nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/dma/processor/dma_p32mx764f128h.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _DMA_P32MX764F128H_H
#define _DMA_P32MX764F128H_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    DMA_ID_0 = _DMAC_BASE_ADDRESS,
    DMA_NUMBER_OF_MODULES = 1

} DMA_MODULE_ID;

typedef enum {

    DMA_CHANNEL_0 = 0x0,
    DMA_CHANNEL_1 = 0x1,
    DMA_CHANNEL_2 = 0x2,
    DMA_CHANNEL_3 = 0x3,
    DMA_NUMBER_OF_CHANNELS = 0x4

} DMA_CHANNEL;

typedef enum {

    DMA_CHANNEL_0_INT_SOURCE = 48,
    DMA_CHANNEL_1_INT_SOURCE = 49,
    DMA_CHANNEL_2_INT_SOURCE = 50,
    DMA_CHANNEL_3_INT_SOURCE = 51

} DMA_CHANNEL_INT_SOURCE;

typedef enum {

    DMA_CHANNEL_PRIORITY_0 = 0x0,
    DMA_CHANNEL_PRIORITY_1 = 0x1,
    DMA_CHANNEL_PRIORITY_2 = 0x2,
    DMA_CHANNEL_PRIORITY_3 = 0x3

} DMA_CHANNEL_PRIORITY;

typedef enum {

    DMA_CHANNEL_TRIGGER_TRANSFER_START = 0x0,
    DMA_CHANNEL_TRIGGER_TRANSFER_ABORT = 0x1,
    DMA_CHANNEL_TRIGGER_PATTERN_MATCH_ABORT = 0x2

} DMA_CHANNEL_TRIGGER_TYPE;

typedef enum {

    DMA_TRIGGER_SOURCE_NONE = -1,
    DMA_TRIGGER_TIMER_CORE = 0,
    DMA_TRIGGER_SOFTWARE_0 = 1,
    DMA_TRIGGER_SOFTWARE_1 = 2,
    DMA_TRIGGER_EXTERNAL_0 = 3,
    DMA_TRIGGER_EXTERNAL_1 = 7,
    DMA_TRIGGER_EXTERNAL_2 = 11,
    DMA_TRIGGER_EXTERNAL_3 = 15,
    DMA_TRIGGER_EXTERNAL_4 = 19,
    DMA_TRIGGER_TIMER_1 = 4,
    DMA_TRIGGER_TIMER_2 = 8,
    DMA_TRIGGER_TIMER_3 = 12,
    DMA_TRIGGER_TIMER_4 = 16,
    DMA_TRIGGER_TIMER_5 = 20,
    DMA_TRIGGER_INPUT_CAPTURE_1 = 5,
    DMA_TRIGGER_INPUT_CAPTURE_2 = 9,
    DMA_TRIGGER_INPUT_CAPTURE_3 = 13,
    DMA_TRIGGER_INPUT_CAPTURE_4 = 17,
    DMA_TRIGGER_INPUT_CAPTURE_5 = 21,
    DMA_TRIGGER_INPUT_CAPTURE_1_ERROR = 61,
    DMA_TRIGGER_INPUT_CAPTURE_2_ERROR = 62,
    DMA_TRIGGER_INPUT_CAPTURE_3_ERROR = 63,
    DMA_TRIGGER_INPUT_CAPTURE_4_ERROR = 64,
    DMA_TRIGGER_INPUT_CAPTURE_5_ERROR = 65,
    DMA_TRIGGER_OUTPUT_COMPARE_1 = 6,
    DMA_TRIGGER_OUTPUT_COMPARE_2 = 10,
    DMA_TRIGGER_OUTPUT_COMPARE_3 = 14,
    DMA_TRIGGER_OUTPUT_COMPARE_4 = 18,
    DMA_TRIGGER_OUTPUT_COMPARE_5 = 22,
    DMA_TRIGGER_SPI_1A_ERROR = 26,
    DMA_TRIGGER_SPI_1A_RECEIVE = 27,
    DMA_TRIGGER_SPI_1A_TRANSMIT = 28,
    DMA_TRIGGER_SPI_2_ERROR = 37,
    DMA_TRIGGER_SPI_2_RECEIVE = 38,
    DMA_TRIGGER_SPI_2_TRANSMIT = 39,
    DMA_TRIGGER_SPI_2A_ERROR = 37,
    DMA_TRIGGER_SPI_2A_RECEIVE = 38,
    DMA_TRIGGER_SPI_2A_TRANSMIT = 39,
    DMA_TRIGGER_SPI_3_ERROR = 26,
    DMA_TRIGGER_SPI_3_RECEIVE = 27,
    DMA_TRIGGER_SPI_3_TRANSMIT = 28,
    DMA_TRIGGER_SPI_3A_ERROR = 40,
    DMA_TRIGGER_SPI_3A_RECEIVE = 41,
    DMA_TRIGGER_SPI_3A_TRANSMIT = 42,
    DMA_TRIGGER_SPI_4_ERROR = 40,
    DMA_TRIGGER_SPI_4_RECEIVE = 41,
    DMA_TRIGGER_SPI_4_TRANSMIT = 42,
    DMA_TRIGGER_I2C_1_ERROR = 29,
    DMA_TRIGGER_I2C_1_SLAVE = 30,
    DMA_TRIGGER_I2C_1_MASTER = 31,
    DMA_TRIGGER_I2C_1A_ERROR = 26,
    DMA_TRIGGER_I2C_1A_SLAVE = 27,
    DMA_TRIGGER_I2C_1A_MASTER = 28,
    DMA_TRIGGER_I2C_2A_ERROR = 37,
    DMA_TRIGGER_I2C_2A_SLAVE = 38,
    DMA_TRIGGER_I2C_2A_MASTER = 39,
    DMA_TRIGGER_I2C_3_ERROR = 26,
    DMA_TRIGGER_I2C_3_SLAVE = 27,
    DMA_TRIGGER_I2C_3_MASTER = 28,
    DMA_TRIGGER_I2C_3A_ERROR = 40,
    DMA_TRIGGER_I2C_3A_SLAVE = 41,
    DMA_TRIGGER_I2C_3A_MASTER = 42,
    DMA_TRIGGER_I2C_4_ERROR = 37,
    DMA_TRIGGER_I2C_4_SLAVE = 38,
    DMA_TRIGGER_I2C_4_MASTER = 39,
    DMA_TRIGGER_I2C_5_ERROR = 40,
    DMA_TRIGGER_I2C_5_SLAVE = 41,
    DMA_TRIGGER_I2C_5_MASTER = 42,
    DMA_TRIGGER_USART_1_ERROR = 26,
    DMA_TRIGGER_USART_1_RECEIVE = 27,
    DMA_TRIGGER_USART_1_TRANSMIT = 28,
    DMA_TRIGGER_USART_1A_ERROR = 26,
    DMA_TRIGGER_USART_1A_RECEIVE = 27,
    DMA_TRIGGER_USART_1A_TRANSMIT = 28,
    DMA_TRIGGER_USART_1B_ERROR = 67,
    DMA_TRIGGER_USART_1B_RECEIVE = 68,
    DMA_TRIGGER_USART_1B_TRANSMIT = 69,
    DMA_TRIGGER_USART_2_ERROR = 40,
    DMA_TRIGGER_USART_2_RECEIVE = 41,
    DMA_TRIGGER_USART_2_TRANSMIT = 42,
    DMA_TRIGGER_USART_2A_ERROR = 37,
    DMA_TRIGGER_USART_2A_RECEIVE = 38,
    DMA_TRIGGER_USART_2A_TRANSMIT = 39,
    DMA_TRIGGER_USART_2B_ERROR = 70,
    DMA_TRIGGER_USART_2B_RECEIVE = 71,
    DMA_TRIGGER_USART_2B_TRANSMIT = 72,
    DMA_TRIGGER_USART_3_ERROR = 37,
    DMA_TRIGGER_USART_3_RECEIVE = 38,
    DMA_TRIGGER_USART_3_TRANSMIT = 39,
    DMA_TRIGGER_USART_3A_ERROR = 40,
    DMA_TRIGGER_USART_3A_RECEIVE = 41,
    DMA_TRIGGER_USART_3A_TRANSMIT = 42,
    DMA_TRIGGER_USART_3B_ERROR = 73,
    DMA_TRIGGER_USART_3B_RECEIVE = 74,
    DMA_TRIGGER_USART_3B_TRANSMIT = 75,
    DMA_TRIGGER_USART_4_ERROR = 67,
    DMA_TRIGGER_USART_4_RECEIVE = 68,
    DMA_TRIGGER_USART_4_TRANSMIT = 69,
    DMA_TRIGGER_USART_5_ERROR = 73,
    DMA_TRIGGER_USART_5_RECEIVE = 74,
    DMA_TRIGGER_USART_5_TRANSMIT = 75,
    DMA_TRIGGER_USART_6_ERROR = 70,
    DMA_TRIGGER_USART_6_RECEIVE = 71,
    DMA_TRIGGER_USART_6_TRANSMIT = 72,
    DMA_TRIGGER_CHANGE_NOTICE = 32,
    DMA_TRIGGER_DMA_0 = 48,
    DMA_TRIGGER_DMA_1 = 49,
    DMA_TRIGGER_DMA_2 = 50,
    DMA_TRIGGER_DMA_3 = 51,
    DMA_TRIGGER_COMPARATOR_1 = 35,
    DMA_TRIGGER_COMPARATOR_2 = 36,
    DMA_TRIGGER_ADC_1 = 33,
    DMA_TRIGGER_PARALLEL_PORT = 34,
    DMA_TRIGGER_CAN_1 = 58,
    DMA_TRIGGER_CLOCK_MONITOR = 46,
    DMA_TRIGGER_RTCC = 47,
    DMA_TRIGGER_FLASH_CONTROL = 56,
    DMA_TRIGGER_USB_1 = 57,
    DMA_TRIGGER_ETH_1 = 60,
    DMA_TRIGGER_PARALLEL_PORT_ERROR = 66

} DMA_TRIGGER_SOURCE;

typedef enum {

    DMA_CRC_IP_HEADER = 0x1,
    DMA_CRC_LFSR = 0x0

} DMA_CRC_TYPE;

typedef enum {

    DMA_CRC_BYTEORDER_NO_SWAPPING = 0x0,
    DMA_CRC_SWAP_BYTE_ON_WORD_BOUNDARY = 0x1,
    DMA_CRC_SWAP_HALF_WORD_ON_WORD_BOUNDARY = 0x2,
    DMA_CRC_SWAP_BYTE_ON_HALF_WORD_BOUNDARY = 0x3

} DMA_CRC_BYTE_ORDER;

typedef enum {

    DMA_INT_ADDRESS_ERROR = 0x1,
    DMA_INT_TRANSFER_ABORT = 0x2,
    DMA_INT_CELL_TRANSFER_COMPLETE = 0x4,
    DMA_INT_BLOCK_TRANSFER_COMPLETE = 0x8,
    DMA_INT_DESTINATION_HALF_FULL = 0x10,
    DMA_INT_DESTINATION_DONE = 0x20,
    DMA_INT_SOURCE_HALF_EMPTY = 0x40,
    DMA_INT_SOURCE_DONE = 0x80

